#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "HIDES"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "HIDES - Health Ideas Data Extraction Service. A dotnet web frontend for building regular large extracts from the Healthideas data warehouse to external providers."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "Health Ideas Data Extraction Service"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://secure.healthideas.gov.bc.ca/hides/*",
        ]
      + web_origins                               = [
          + "+",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HIDES.keycloak_openid_user_attribute_protocol_mapper.idir_displayName will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_displayName" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "idir_displayName"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_displayName"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_displayName"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HIDES.keycloak_openid_user_attribute_protocol_mapper.idir_user_guid will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_user_guid" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "idir_user_guid"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_user_guid"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_user_guid"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.HIDES.keycloak_openid_user_attribute_protocol_mapper.idir_username will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_username" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "idir_username"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_username"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_username"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HIDES.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "24716008-8b6c-407f-861a-adc5de1b3e67"
        name                                       = "Health Ideas Data Extraction Service"
      ~ valid_redirect_uris                        = [
          + "https://uatsecure.heaalthideas.gov.bc.ca/hidesacc/*",
          + "https://uatsecure.heaalthideas.gov.bc.ca/hidesuat/*",
          - "https://uatsecure.healthideas.gov.bc.ca/acc/hides/*",
          - "https://uatsecure.healthideas.gov.bc.ca/uat/hides/*",
            # (3 unchanged elements hidden)
        ]
        # (23 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*